<template>
    <section>
        <header class="flex -mx-3">
            <main class="w-3/4 flex flex-wrap px-3">
                <main class="flex w-full">
                    <div class="w-1/2 relative mb-1 pr-0.5">
                        <main class="relative rounded overflow-hidden">
                            <aside
                                class="bg-gradient-to-t from-stone-900/50 via-stone-900/20 to-stone-900/30 absolute inset-0">
                                <div class="text-white text-2xl w-full h-full flex items-center justify-center">
                                    Uchquduq
                                </div>
                            </aside>
                            <img src="/img/1.jpg" class="w-full h-72 object-cover">
                        </main>
                    </div>
                    <div class="w-1/2 relative  mb-1 pl-0.5">
                        <main class="relative rounded overflow-hidden">
                            <aside class="bg-gradient-to-t from-stone-900/50 via-stone-900/20 to-stone-900/30 absolute inset-0">
                                <div class="text-white text-2xl w-full h-full flex items-center justify-center">
                                    Oltin ko'l
                                </div>
                            </aside>
                            <img src="/img/3.jpg" class="w-full h-72 object-cover">
                        </main>
                    </div>
                </main>
                <div class="relative rounded overflow-hidden w-full">
                    <aside class="bg-gradient-to-t from-stone-900/50 via-stone-900/20 to-stone-900/30 absolute inset-0">
                        <div class="text-white text-2xl w-full h-full flex items-center justify-center">
                            Karvon
                        </div>
                    </aside>
                    <img src="/img/4.jpg" class="w-full h-72 object-cover">
                </div>
                <main class="text-gray-700">
                    <h3 class="my-4 text-3xl ">
                        Biz Haqimizda
                    </h3>
                    <p class="border-l border-yellow-500 pl-10 py-3 text-gray-900 my-10">
                        Шимолий кон бошқармаси мамлакатимизда олтин маҳсулотлар ишлаб чиқарадиган – салоҳиятли муҳандис-техник кадрларга
                        эга, ривожланган инфратузилмали замонавий корхона НКМК АЖ дай гигант корхонанинг бешиги ҳисобланади.
                    </p>


                    <h3 class="text-center font-semibold text-gray-900 mb-5">
                        УЧҚУДУҚ – МЕҲНАТЛАР ЭВАЗИГА БУНЁД БЎЛГАН ШАҲАР
                    </h3>
                    <p class="mb-3 indent-8">
                        Уранли маъдан қазиш ишларининг бошланиши Учқудуқ шаҳрининиг Қизилқум чўлида бунёд бўлишига асосий сабаблардан
                        бири. Бошланғич лойиҳага кўра, вахта бригадалари кўринишида ишлайдиган аҳоли яшаш пункти сифатида қурилиш ишлари
                        режалаштирилган эди. Учқудуқ шахрининиг қурилиши 1956 йилнинг баҳорида, илк қурувчилар десантини келиб тушишидан
                        бошланди. Аввалига иккки лойиҳавий биноларнинг қурилишидан сўнг қурилиш суръати жалдал ўсган. 1956 йилнинг
                        сентябрь ойига келиб шаҳар типидаги аҳоли яшаш пунктига айланди. Аҳоли пунктининг бош лойиҳаси қайта кўриб
                        чиқилиб қурилиш ҳажми оширилиб, маиший, маънавий ва жамоавий объектларнинг қурилиши режалаштирилди.
                    </p>


                    <p class="mb-3 indent-8">
                        Учқудуқ шаҳри ташкилотларнинг қурилиши учун оддий сувоқчидан тортиб, малакали кадрлар, техник муҳандис-ходимлар
                            талаб қилинар эди. Шу сабабдан илк кунларданоқ комбинатнинг кадрлар хизматига улкан ҳажмдаги иш юкланди.
                            Ходимларни ишга қабул қилиш географияси жуда кенг бўлиб, мамлакат бўйлаб хат ва таклифномалар юборилди.
                        Кон-металлургия комбинати вакиллари собиқ Иттифоқи Республикалари бўйлаб мавжуд олийгоҳлардан ўқиётган талабалар
                        орасида корхона учун зарур бўлган турли мутахассисликлар учун танловлар ўтказишди. Қилинган қатъий
                        саъй-ҳаракатлар ўз самарасини берди. Кончилар ва муҳандисларнинг дастлабки гуруҳлари 1958-йилнинг ноябрида кела
                        бошлади ва 1960-йилда Учқудуқга малакали шахта қутқарув ходимлари етиб келди. Шу йилнинг 6 сентябрь куни
                        Навоий-Учқудуқ оғир юкга мўлжалланган темир йўли қатнови учун 290км ва бироздан сўнг 1961 йилда йўловчи ташиш
                        йўлга қўйилди. Учқудуққа техник мақсадларга мўлжалланган сув 1961-йил 1-майда “Бешбулоқ” сув йиғиш иншоотидан
                        қувурлар орқали кириб келди. 1962-йил июнь ойида аҳоли яшаш пунктида ҳақиқий байрам – “Учқудуқ-Айтим–Мингбулоқ”
                        сув қувури қурилишининг якунланиши ва ичимлик суви тортиб келиниши бўлди.
                    </p>

                    <p class="mb-3 indent-8">
                        Аҳоли пунктини электр энергияси билан таъминлаш мақсадида Кармана марказидан 220 кВт юқори кучланишли
                        узунликдаги 320 км линия қурилиши амалга оширилди. 1962 йилда ИЭЦ-6 биноси, биринчи мактаб, 1,2-сонли болалар
                        боғчалари қуриб топширилди. “Горная”, “Октябрская”, “Тинчлик” кўчалари бўйлаб 2,3 микротуманларининг барча икки
                        қаватли уйлари қурилди. 1963йилда 5-,6-сонли микротуманлар, 2-сонли мактаб биноси бунёд этилди. 1965-1966-йиллар
                        спорт мажмуаси ва сузиш ҳавзаси, 5-ва 6-сонли болалар боғчалари, 2-сонли тиббий-санитария қисми иншоотлари
                        фойдаланишга топширилди. Шунингдек, 7-микротуман, "Ўзбекистон" дўкони, "Бухоро" кинотеатри ва “Современник”
                        (ҳозирги “Учқудуқ”) маданият саройи қурилиши давом эттирилди. 1969-йилга келиб шаҳарнинг асосий қурилишининг
                        биринчи босқичи тугалланди. 1970 йилдан 1975 йилгача бўлган даврда "Кончи" профилакторий даволаниш маскани,
                        ётоқхоналар, дорихоналар, сут заводи, каръер транспорти автокорхонаси қурилди. Республика Президиуми Олий
                        Кенгашининг 1978-йил 19-апрелдаги фармони билан Учқудуқ шаҳар типидаги вилоят бошқарувидаги шаҳар деб
                        таснифланди
                    </p>


            


                </main>
            </main>
            <RandomPosts></RandomPosts>
        </header>
        <main>

    </main>
</section></template>

<script setup lang="ts">
import RandomPosts from '@/components/RandomPosts.vue';
</script>